Doly02/nxp-mcxn947-datalogger/application/source/record.c
/******************************
 *  Project:        NXP MCXN947 Datalogger
 *  File Name:      fatfs.h
 *  Author:         Tomas Dolak
 *  Date:           18.11.2024
 *  Description:    File Includes Operation For Recoding Mode.
 *
 * ****************************/

/******************************
 *  @package        NXP MCXN947 Datalogger
 *  @file           fatfs.h
 *  @author         Tomas Dolak
 *  @date           18.11.2024
 *  @brief          File Includes Operation For Recoding Mode.
 * ****************************/

/*******************************************************************************
 * Includes
 ******************************************************************************/
#include <record.h>
#include "fsl_irtc.h"

#include <limits.h>
/*******************************************************************************
 * Definitions
 ******************************************************************************/
/**
 * @brief 	Software FIFO Size.
 */
#define FIFO_SIZE 					1024U

/**
 * @brief 	Block Size For Write To SDHC Card Operation (In Bytes).
 */
#define BLOCK_SIZE 					512U

/**
 * @brief Convert Time In Seconds To Number of Ticks.
 *
 * @param 	seconds Number of Seconds To Transfer.
 * @return 	Number of Ticks Corresponding To The Specified Number of Seconds.
 */
#define GET_WAIT_INTERVAL(seconds)  ((seconds) * 1000 / configTICK_RATE_HZ)

/*
 * @brief 	Time Interval Between LED Blinking.
 * @details	In Seconds.
 */
#define RECORD_LED_TIME_INTERVAL 	0.01
/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Global Variables
 ******************************************************************************/
/*
 * @brief 	File System Object,
 */
static FATFS g_fileSystem;

/*
 * @brief 	File Object.
 * @details Pointer to Current Opened File.
 */
static FIL g_fileObject;

/*
 * @brief	Name Of The Folder Where The Files (Logs)
 * 			From The Current Session Are Stored.
 */
static char g_currentDirectory[32];

/**
 * @brief 	Configuration of The Data Logger on The Basis of Data
 * 			Obtained From The Configuration File.
 */
static REC_config_t g_config;

/*
 *  @brief decription about the read/write buffer
 * 	The size of the read/write buffer should be a multiple of 512, since SDHC/SDXC card uses 512-byte fixed
 * 	block length and this driver example is enabled with a SDHC/SDXC card.If you are using a SDSC card, you
 * 	can define the block length by yourself if the card supports partial access.
 * 	The address of the read/write buffer should align to the specific DMA data buffer address align value if
 * 	DMA transfer is used, otherwise the buffer address is not important.
 * 	At the same time buffer address/size should be aligned to the cache line size if cache is supported.
 **************/

/**
 * @defgroup 	Recording Buffers and Recording Management
 * @brief 		Group Contains Variables For Management of Recording.
 * @details 	Includes DMA Buffers For Recording, Indexes, Pointers, ...
 * @{
 */

/**
 * @brief 	Data For Multi-Buffering - In Particular Dual-Buffering,
 * 			One Is Always Filled, The Other Is Processed.
 */
SDK_ALIGN(static uint8_t g_dmaBuffer1[BLOCK_SIZE], BOARD_SDMMC_DATA_BUFFER_ALIGN_SIZE);

SDK_ALIGN(static uint8_t g_dmaBuffer2[BLOCK_SIZE], BOARD_SDMMC_DATA_BUFFER_ALIGN_SIZE);

/**
 * @brief 	Active Buffer Which Receives Data From UART Periphery.
 */
static uint8_t* g_activeDmaBuffer 	= g_dmaBuffer1;

/**
 * @brief 	Pointer on DMA Buffer Into Which The Time Stamps Are Inserted.
 */
static uint8_t* g_processDmaBuffer 	= NULL;

/**
 * @brief 	Index Into Active DMA Buffer.
 */
static uint16_t g_dmaIndex 			= 0;

/**
 * @brief 	Indicates That Collection Buffer (Active Buffer) Is Full and Ready To Swap.
 */
static bool g_dmaBufferReady 		= false;

/**
 * @brief 	Value of Ticks When Last Character Was Received Thru LPUART.
 */
static TickType_t g_lastDataTick 	= 0;

/**
 * @brief	Tracks Current File Size.
 */
static uint32_t g_currentFileSize 	= 0;

/**
 * @brief	Counter For Unique File Names.
 */
static uint16_t g_fileCounter 		= 1;

/**
 * @brief 	Flush Completed Flag.
 * @details If No Data of The LPUART Periphery Are Received Within The `FLUSH_TIMEOUT_TICKS`
 * 			Interval, The Data Collected So Far In The Buffer Are Flushed To The File.
 */
static bool g_flushCompleted 		= false;

/**
 * @brief	Transferred Bytes Between Blinking LEDs.
 */
static uint32_t g_bytesTransfered	= 0U;

/** @} */ // End of Recording Buffers and Recording Management

/**
 * @defgroup 	UART Management
 * @brief 		Group Contains Variables For Recording From UART.
 * @details 	Data From UART Are Stored Into FIFO (Circular Buffer).
 * @{
 */

SDK_ALIGN(static volatile uint8_t g_fifo[FIFO_SIZE], BOARD_SDMMC_DATA_BUFFER_ALIGN_SIZE);	// FIFO buffer

/**
 * @brief	Index For Writing Into FIFO.
 */
static volatile uint32_t g_writeIndex 		= 0;

/**
 * @brief 	Index For Reading From FIFO.
 */
static volatile uint32_t g_readIndex 		= 0;

/** @} */ // End of UART Management Group


/*******************************************************************************
 * Interrupt Service Routines (ISRs)
 ******************************************************************************/
/**
 * @brief LPUART3 IRQ Handler.
 *
 */
void LP_FLEXCOMM3_IRQHandler(void)
{
    uint8_t data;
    uint32_t stat;

    /* Check For New Data */
    stat = LPUART_GetStatusFlags(LPUART3);
    if ((uint32_t)kLPUART_RxDataRegFullFlag & stat)
    {
        data = LPUART_ReadByte(LPUART3);
        /* Add Data To FIFO */
        uint16_t nextWriteIndex = (g_writeIndex + 1U) % FIFO_SIZE;
        if (nextWriteIndex != g_readIndex) // Check if FIFO is not full
        {
        	g_fifo[g_writeIndex] = data;
            g_writeIndex = nextWriteIndex;

            /* Update Time Of Last Receiving */
            g_lastDataTick = xTaskGetTickCount();
            g_flushCompleted = false;
        }
        g_bytesTransfered++;
    }

