Doly02/nxp-mcxn947-datalogger/application/source/record.c
    /* Clear Interrupt Flag */
    LPUART_ClearStatusFlags(LPUART3, (uint32_t)kLPUART_RxDataRegFullFlag);
    SDK_ISR_EXIT_BARRIER;
}

/*******************************************************************************
 * Code
 ******************************************************************************/
DWORD get_fattime(void)
{
    irtc_datetime_t datetime = { 0U };

    IRTC_GetDatetime(RTC, &datetime);

    return ((DWORD)(datetime.year - (uint16_t)1980) << 25) |
           ((DWORD)datetime.month << 21) |
           ((DWORD)datetime.day << 16) |
           ((DWORD)datetime.hour << 11) |
           ((DWORD)datetime.minute << 5) |
           ((DWORD)(datetime.second / (uint8_t)2));
}

int CONSOLELOG_Abs(int x)
{
    if (x == INT_MIN) {
        return INT_MAX;
    }
    return (x < 0) ? -x : x;
}


error_t CONSOLELOG_CreateFile(void)
{
    FRESULT status;
    char fileName[64];					//<! TODO: Vypocitat Maximalni pocet souboru za den na zaklade baud rate
    irtc_datetime_t datetimeGet;		//<! To Store Time in File Meta-Data
    FILINFO fno;						//<! File Meta-Data

    IRTC_GetDatetime(RTC, &datetimeGet);

    /* Generate a New File Name */
    /* @note snprintf() Is Depricated But There Is No Better Equivalent */
    //lint -save -e586
    (void)snprintf(fileName, sizeof(fileName), "%s/%04d%02d%02d_%02d%02d%02d_%u.txt",
    		g_currentDirectory, datetimeGet.year, datetimeGet.month, datetimeGet.day,
             datetimeGet.hour, datetimeGet.minute, datetimeGet.second,
             g_fileCounter++);
    //lint -restore

    /* Open New File */
    status = f_open(&g_fileObject, fileName, (FA_WRITE | FA_CREATE_ALWAYS));
    if (FR_OK != status)
    {
        PRINTF("ERR: Failed to create file %s. Error=%d\r\n", fileName, (uint32_t)status);
        return ERROR_OPEN;
    }

    /* Setup of File Meta-Data */
    fno.fdate = ((datetimeGet.year - 1980) << 9) | (datetimeGet.month << 5) | (datetimeGet.day);
    fno.ftime = (datetimeGet.hour << 11) | (datetimeGet.minute << 5) | (datetimeGet.second / 2);
    status = f_utime(fileName, &fno);
    if (FR_OK != status)
    {
        PRINTF("ERR: Failed to Set Meta-Data for %s. Error=%d\r\n", fileName, status);
        status = f_close(&g_fileObject);
        if (FR_OK != status)
        {
            return ERROR_CLOSE;
        }
        return ERROR_FILESYSTEM;
    }

    g_currentFileSize = 0; // Reset file size
#if (true == INFO_ENABLED || true == DEBUG_ENABLED)
    PRINTF("INFO: Created Log %s.\r\n", fileName);
#endif

    return ERROR_NONE;
}

error_t CONSOLELOG_CreateDirectory(void)
{
    FRESULT status;
    irtc_datetime_t datetimeGet;
    char directoryName[32];
    uint32_t counter = 1;

    IRTC_GetDatetime(RTC, &datetimeGet);

    /* Attempt to Create a New Folder With a Unique Name (Date + Cnt) */
    do
    {
        /* @note snprintf() Is Depricated But There Is No Better Equivalent */
        //lint -save -e586
    	(void)snprintf(directoryName, sizeof(directoryName), "/%04d%02d%02d_%u",
                 datetimeGet.year, datetimeGet.month, datetimeGet.day, counter++);
        //lint -restore
        status = f_mkdir(directoryName);
    } while ((FR_EXIST == status) && (counter < 1000));

    if (FR_OK != status)
    {
        PRINTF("ERR: Failed To Create Session Directory. Error=%d\r\n", (uint16_t)status);
        return ERROR_FILESYSTEM;
    }

    /* @note snprintf() Is Depricated But There Is No Better Equivalent */
    //lint -save -e586
    (void)snprintf(g_currentDirectory, sizeof(g_currentDirectory), "%s", directoryName);
    //lint -restore

#if (true == INFO_ENABLED || true == DEBUG_ENABLED)
    PRINTF("INFO: Created Directory %s.\r\n", g_currentDirectory);
#endif /* (true == INFO_ENABLED) */
    return ERROR_NONE;
}

REC_config_t CONSOLELOG_GetConfig(void)
{
	return g_config;
}

REC_version_t CONSOLELOG_GetVersion(void)
{
	return g_config.version;
}

uint32_t CONSOLELOG_GetBaudrate(void)
{
	return g_config.baudrate;
}

uint32_t CONSOLELOG_GetFileSize(void)
{
	return g_config.size;
}

uint32_t CONSOLELOG_GetTransferedBytes(void)
{
	return g_bytesTransfered;
}

bool CONSOLELOG_GetFlushCompleted(void)
{
	return g_flushCompleted;
}

void CONSOLELOG_ClearTransferedBytes(void)
{
	g_bytesTransfered = 0;
}

uint32_t CONSOLELOG_GetMaxBytes(void)
{
	return g_config.max_bytes;
}

FRESULT CONSOLELOG_CheckFileSystem(void)
{
    DIR sDir;
    /* Try To Open Root Folder */
    FRESULT sRes = f_opendir(&sDir, "/");
    if (FR_OK == sRes)
    {
        sRes = f_closedir(&sDir);
    }
    return sRes;
}

error_t CONSOLELOG_Init(void)
{
	FRESULT status;
	g_config.version 	= WCT_UNKOWN;
	g_config.baudrate 	= 0;

	/* Logic Disk */
	const TCHAR sLogicDisk[3U] = {SDDISK + '0', ':', '/'};
	BYTE work[FF_MAX_SS];

	/* Mount File System */
	if (FR_OK != f_mount(&g_fileSystem, sLogicDisk, 0U))
	{
		PRINTF("ERR: Mount Volume Failed.\r\n");
		return ERROR_FILESYSTEM;
	}

#if (FF_FS_RPATH >= 2U)

	/* Setup of Actual Work Logic Disk */
	status = f_chdrive((char const *)&sLogicDisk[0U]);
    if (ERROR_NONE != status)
    {
        PRINTF("ERR: Change Drive Failed.\r\n");
        return ERROR_FILESYSTEM;
    }
#else
	#error "ERR: Disabled f_chdrive Function, Set The FF_FS_RPATH To Value Value That Is Equal Or Bigger Then 2."
#endif	/* (FF_FS_RPATH >= 2U) */

#if FF_USE_MKFS

    if (FR_OK != CONSOLELOG_CheckFileSystem())
    {

#if (true == DEBUG_ENABLED)
        PRINTF("DEBUG: File System Not Found. Formatting...\r\n");
#endif /* (true == DEBUG_ENABLED) */

        /* Make File System */
        if (f_mkfs(sLogicDisk, 0, work, sizeof work))
        {
            PRINTF("ERR: Init File System Failed.\r\n");
            return ERROR_FILESYSTEM;
        }
    }
#else
	#error "ERR: f_mkfs() Function Is Disabled."
#endif 	/* FF_USE_MKFS */

    if (ERROR_NONE != CONSOLELOG_CreateDirectory())
    {
        PRINTF("ERR: Failed to create directory for logs.\r\n");
        return ERROR_FILESYSTEM;
    }

    return ERROR_NONE;
}

error_t CONSOLELOG_Recording(uint32_t file_size)
{
    FRESULT error;
    UINT bytesWritten;               //<! Bytes Written Into SD Card
    irtc_datetime_t datetimeGet;     //<! Actual Time From IRTC
    static uint8_t lastChar = 0;     //<! Last Character From Previous DMA Buffer

    static char timeString[12];
    static uint8_t timeLength = 0;

    while (g_readIndex != g_writeIndex)
    {
        /* Loads One Char From FIFO And Stores The Char Into Active DMA Buffer */
        uint8_t currentChar = g_fifo[g_readIndex];
        g_readIndex = (g_readIndex + 1) % FIFO_SIZE;

