Doly02/nxp-mcxn947-datalogger/application/source/record.c
        g_activeDmaBuffer[g_dmaIndex++] = currentChar;

        /* Check If The CRLF Is Not Divided Into Two DMA Buffers */
        if (((lastChar == (uint8_t)'\r') && (currentChar == (uint8_t)'\n')) ||
            ((g_dmaIndex >= 2) &&
             (g_activeDmaBuffer[g_dmaIndex - 2] == (uint8_t)'\r') &&
             (g_activeDmaBuffer[g_dmaIndex - 1] == (uint8_t)'\n')))
        {

        	IRTC_GetDatetime(RTC, &datetimeGet);
            timeLength = (uint8_t)snprintf(timeString, sizeof(timeString), "(%02d:%02d:%02d) ", datetimeGet.hour, datetimeGet.minute, datetimeGet.second);

            /* Addition of Time Mark To The DMA Buffer */
            for (uint8_t i = 0; i < timeLength; i++)
            {
                if (BLOCK_SIZE > g_dmaIndex)	// If DMA Buffer is Not Full
                {
                    g_activeDmaBuffer[g_dmaIndex++] = (uint8_t)timeString[i];
                }
                else
                {
                    /* Switch To New DMA Buffer */
                	g_processDmaBuffer = g_activeDmaBuffer;
                    g_dmaBufferReady = true;

                    g_activeDmaBuffer = (g_activeDmaBuffer == g_dmaBuffer1) ? g_dmaBuffer2 : g_dmaBuffer1;
                    g_dmaIndex = 0;

                    /* Continue in Addition of Time Mark */
                    g_activeDmaBuffer[g_dmaIndex++] = (uint8_t)timeString[i];
                }
            }
        }

        lastChar = currentChar; // Current Last Character For Next Buffer

        /* Check If DMA Buffer Is Full */
        if (BLOCK_SIZE == g_dmaIndex)
        {
            g_processDmaBuffer = g_activeDmaBuffer;
            g_dmaBufferReady = true;

            /* Switch on Next DMA Buffer */
            g_activeDmaBuffer = (g_activeDmaBuffer == g_dmaBuffer1) ? g_dmaBuffer2 : g_dmaBuffer1;
            g_dmaIndex = 0;
        }
    }

    /* Process Full DMA Buffer */
    if (g_dmaBufferReady && (NULL != g_processDmaBuffer))
    {
        if (NULL == g_fileObject.obj.fs)
        {
            if (ERROR_NONE != CONSOLELOG_CreateFile())
            {
                PRINTF("ERR: Failed to create new file.\r\n");
                return ERROR_OPEN;
            }
        }

		/**
		* ADMA Error Status (ADMA_ERR_STATUS)
		* 3 bit 	-> 	ADMA Descriptor Error
		* 2 bit 	-> 	ADMA Length Mismatch Error
		* 1-0 bit 	-> 	ADMA Error State (When ADMA Error Occurred)
		*				Field Indicates The State of The ADMA When An
		*				Error Has Occurred During An ADMA Data Transfer.
		*/
        uint32_t stat_reg = g_sd.host->hostController.base->ADMA_ERR_STATUS;
        if (0x0U != (stat_reg & (uint32_t)0xC))
        {
            PRINTF("ERR: Failed to Write Data To File. Error=%d\r\n", ERROR_ADMA);
            (void)f_close(&g_fileObject);
            g_fileObject.obj.fs = NULL;
            return ERROR_ADMA;
        }
        error = f_write(&g_fileObject, g_processDmaBuffer, BLOCK_SIZE, &bytesWritten);
        if (FR_OK != error)
        {
        	return (error_t)error;
        }

        g_currentFileSize += BLOCK_SIZE;
        if (g_currentFileSize >= file_size)
        {
#if (true == INFO_ENABLED || true == DEBUG_ENABLED)
            PRINTF("INFO: File Size Limit Reached. Closing file. (LIMIT: %d, CURRENT %d)\r\n", file_size, g_currentFileSize);
#endif /* (true == INFO_ENABLED || true == DEBUG_ENABLED) */
            (void)f_close(&g_fileObject);
            g_fileObject.obj.fs = NULL;
        }

        g_dmaBufferReady = false;     // Reset Flag of ADMA Buffer
        g_processDmaBuffer = NULL;    // Clear g_processDmaBuffer
    }

    return ERROR_NONE;
}

error_t CONSOLELOG_Flush(void)
{
	FRESULT error;
	UINT bytesWritten;
	int tickDiff 			= 0;
	uint32_t lastTick 		= 0U;
	uint32_t currentTick 	= xTaskGetTickCount();

	/*
	 * __ATOMIC_ACQUIRE - 	Ensures That All Read Values Are Consistent
	 * 						With Pre-Read Operations.
	 * */
	lastTick = __atomic_load_n(&g_lastDataTick, __ATOMIC_ACQUIRE);

	tickDiff = (int)(currentTick - lastTick);
	if ((CONSOLELOG_Abs(tickDiff) > FLUSH_TIMEOUT_TICKS) && (g_dmaIndex > 0))
	{
#if (true == INFO_ENABLED)
		PRINTF("INFO: Current Ticks = %d.\r\n", currentTick);
		PRINTF("INFO: Last Ticks = %d.\r\n", g_lastDataTick);
		PRINTF("INFO: Flush Triggered. Writing Remaining Data To File.\r\n");
#else
		PRINTF("INFO: Flush Triggered.\r\n");
#endif /* (true == INFO_ENABLED) */

		while (g_dmaIndex < BLOCK_SIZE)			/* Fill Buffer With ' ' */
		{
			g_activeDmaBuffer[g_dmaIndex++] = ' ';
		}

		g_processDmaBuffer 	= g_activeDmaBuffer;
		g_dmaBufferReady 	= true;

		// Switch To Second Buffer
		g_activeDmaBuffer 	= (g_activeDmaBuffer == g_dmaBuffer1) ? g_dmaBuffer2 : g_dmaBuffer1;
		g_dmaIndex 			= 0;

		if (NULL == g_fileObject.obj.fs)
		{
			if (ERROR_NONE != CONSOLELOG_CreateFile())
			{
				PRINTF("ERR: Failed to Create New File During Flush.\r\n");
				return ERROR_RECORD;
			}
		}

#if (CONTROL_LED_ENABLED == true )
		LED_SignalFlush();				/* Signal Flush							*/
		LED_SignalRecordingStop();		/* Signal That Recording Is Not Active	*/

#endif /* (CONTROL_LED_ENABLED == true ) */

		/**
		* ADMA Error Status (ADMA_ERR_STATUS)
		* 3 bit 	-> 	ADMA Descriptor Error
		* 2 bit 	-> 	ADMA Length Mismatch Error
		* 1-0 bit 	-> 	ADMA Error State (When ADMA Error Occurred)
		*				Field Indicates The State of The ADMA When An
		*				Error Has Occurred During An ADMA Data Transfer.
		*/
		uint32_t stat_reg = g_sd.host->hostController.base->ADMA_ERR_STATUS;
		if (0x0U != (stat_reg & (uint32_t)0xC))
		{
			PRINTF("ERR: Failed to Write Data To File During Flush. Error=%d\r\n", ERROR_ADMA);
			(void)f_close(&g_fileObject);
			g_fileObject.obj.fs = NULL;
			return ERROR_ADMA;
		}
		error = f_write(&g_fileObject, g_processDmaBuffer, BLOCK_SIZE, &bytesWritten);
		if (FR_OK != error)
		{
			return (error_t)error;
		}
		g_currentFileSize += BLOCK_SIZE;

#if	(true == INFO_ENABLED || true == DEBUG_ENABLED)
		PRINTF("INFO: Closing File\r\n");
#endif /* (true == INFO_ENABLED || true == DEBUG_ENABLED) */

		(void)f_close(&g_fileObject);
		g_fileObject.obj.fs = NULL;
		g_dmaBufferReady = false;
		g_processDmaBuffer = NULL;
		g_flushCompleted = true;
	}
	return ERROR_NONE;
}

error_t CONSOLELOG_Deinit(void)
{
	FRESULT error;

