Doly02/nxp-mcxn947-datalogger/application/source/record.c
	/* Stop Generating UART Interrupt */
	UART_Disable();

	/* Close All Opened Files */
    if (NULL != g_fileObject.obj.fs)
    {
        error = f_close(&g_fileObject);
        if (FR_OK != error)
        {
            PRINTF("ERR: Failed to Close File. ERR=%d\r\n", error);
            return ERROR_CLOSE;
        }
    }


	/* Unmount File System From Logic Drive */
	error = f_mount(NULL, "", 0);
	if (FR_OK != error)
	{
		PRINTF("ERR: Failed To Unmount File System. Error=%d\r\n", error);
		return ERROR_RECORD;
	}

#if (true == DEBUG_ENABLED)
	PRINTF("DEBUG: File System De-Inicialized.\r\n");
#endif /* (true == DEBUG_ENABLED) */

	return ERROR_NONE;
}

error_t CONSOLELOG_ReadConfig(void)
{
    FRESULT error;
    DIR dir;           					//<! Opened Directory
    FILINFO fno;       					//<! Information About File
    FIL configFile;    					//<! Opened File
    UINT bytesRead;    					//<! Number of Read Bytes

    error = f_opendir(&dir, "/");
    if (FR_OK != error)
    {
#if (CONTROL_LED_ENABLED == true)
    	LED_SignalError();
#endif /* (CONTROL_LED_ENABLED == true) */

    	PRINTF("ERR: Failed to Open Root Dir. ERR=%d\r\n", error);
        return ERROR_OPEN;
    }

    while (true)
	{
    	error = f_readdir(&dir, &fno);
    	if (FR_OK != error || 0 == fno.fname[0])
		{
			break; 	// End of Directory or Error
		}

    	if (!(fno.fattrib & AM_DIR))	// If Not Directory
    	{
    		if (ERROR_NONE == strcmp(fno.fname, CONFIG_FILE))	// If .config File
			{
    			PRINTF("DEBUG: Found .config File: %s\r\n", fno.fname);

    			error = f_open(&configFile, CONFIG_FILE, FA_READ);
    			if (FR_OK != error)
				{
#if (CONTROL_LED_ENABLED == true)
    				LED_SignalError();
#endif /* (CONTROL_LED_ENABLED == true) */

    				PRINTF("ERR: Failed to open .config file. ERR=%d\r\n", error);
    				(void)f_closedir(&dir); 	// Close Root Directory
					return ERROR_OPEN;
				}
    			(void)memset(g_dmaBuffer1, 0, sizeof(g_dmaBuffer1));
    			error = f_read(&configFile, g_dmaBuffer1, sizeof(g_dmaBuffer1) - 1, &bytesRead);
				if (FR_OK != error)
				{
#if (CONTROL_LED_ENABLED == true)
					LED_SignalError();
#endif /* (CONTROL_LED_ENABLED == true) */

					PRINTF("ERR: Failed To Read .config File. ERR=%d\r\n", error);
					(void)f_close(&configFile);
					(void)f_closedir(&dir);
					return ERROR_READ;
				}

				if (ERROR_NONE != CONSOLELOG_ProccessConfigFile((const char *)g_dmaBuffer1))
				{
#if (CONTROL_LED_ENABLED == true)
					LED_SignalError();
#endif /* (CONTROL_LED_ENABLED == true) */

					PRINTF("ERR: Failed To Read .config File. ERR=%d\r\n", error);
					(void)f_close(&configFile);
					(void)f_closedir(&dir);
					return ERROR_READ;
				}

				// Processed Configuration File
				(void)f_close(&configFile);
				(void)f_closedir(&dir);
				return ERROR_NONE;
			}
    	}
	}
    PRINTF("ERR: .config file not found in root directory.\r\n");
    (void)f_closedir(&dir);
	return ERROR_OPEN;
}

error_t CONSOLELOG_ProccessConfigFile(const char *content)
{
    const char *key = "baudrate=";
    const char *keyFileSize = "file_size=";

    char *found;
    uint32_t baudrate;
    uint32_t value;

    /* Find Key "baudrate=" */
    found = strstr(content, key);
    if (NULL == found)
    {
#if (CONTROL_LED_ENABLED == true)
    	LED_SignalError();
#endif /* (CONTROL_LED_ENABLED == true) */

        PRINTF("ERR: Key 'baudrate=' Not Found.\r\n");
        return ERROR_READ;
    }

    found += strlen(key);					// Move Pointer Behind "baudrate="
    baudrate = (uint32_t)atoi(found);		// Convert Value To INT
    if (0 >= baudrate)
	{
#if (CONTROL_LED_ENABLED == true)
    	LED_SignalError();
#endif /* (CONTROL_LED_ENABLED == true) */

		PRINTF("ERR: Invalid Baudrate Value.\r\n");
		return ERROR_READ;
	}

    switch (baudrate)
	{
		case 230400U:
			g_config.version = WCT_AUTOS2;
			break;
		case 115200U:
			g_config.version = WCT_AUTOS1;
			break;
		default:
#if (CONTROL_LED_ENABLED == true)
			LED_SignalError();
#endif /* (CONTROL_LED_ENABLED == true) */

			PRINTF("ERR: Unsupported Baudrate Value: %d\r\n", baudrate);
			return ERROR_CONFIG;
	}

    g_config.baudrate = baudrate;

    /* Find Key "file_size=" */
    found = strstr(content, keyFileSize);
    if (NULL == found)
    {
#if (CONTROL_LED_ENABLED == true)
    	LED_SignalError();
#endif /* (CONTROL_LED_ENABLED == true) */

        PRINTF("ERR: Key 'file_size=' Not Found.\r\n");
        return ERROR_READ;
    }

    found += strlen(keyFileSize);			// Move Pointer Behind "file_size="
    value = (uint32_t)atoi(found);			// Convert Value To INT
    if (0 >= value)
    {
#if (CONTROL_LED_ENABLED == true)
    	LED_SignalError();
#endif /* (CONTROL_LED_ENABLED == true) */

        PRINTF("ERR: Invalid File Size Value.\r\n");
        return ERROR_READ;
    }
    if (value % 512 != 0)
    {
    	/* Round Up To 512 */
        uint32_t roundedValue = ((value + 511) / 512) * 512;
        PRINTF("WARN: File Size %d Is Not a Multiple of 512. Rounding Up to %d.\r\n", value, roundedValue);
        value = roundedValue;
    }

    g_config.size = value;  // Store File Size in Configuration Structure
    g_config.max_bytes = RECORD_LED_TIME_INTERVAL * g_config.baudrate;
    PRINTF("DEBUG: File Size Set To %d Bytes.\r\n", g_config.size);

    return ERROR_NONE;
}
